## ----------------------------------------
##  Brewfile
## ----------------------------------------
tap "homebrew/cask"
cask_args appdir: "/Applications"

## ========== Base ==========
brew "git"
brew "grep"
brew "ffmpeg"
brew "git-lfs"
brew "youtube-dl"
brew "lolcat"

## ========== Shell ==========
brew "zsh"
brew "zsh-completions"

## ========== Applications ==========
cask "1password"
cask "alfred"
cask "calibre"
cask "brave-browser"
cask "docker"
cask "dropbox"
cask "iterm2"
cask "mp4tools"
cask "toggl"
cask "handbrake"
cask "bettertouchtool"
cask "the-unarchiver"
cask "discord"
cask "postman"
cask "sourcetree"
cask "spotify"
cask "google-chrome"
cask "firefox"
cask "whatsapp"
cask "visual-studio-code"
cask "vlc"
